'''
Задание №1

Вспомните какие модули вы уже проходили на курсе.
Создайте файл, в котором вы импортируете встроенные в модуль функции под псевдонимами (3-7 строк импорта).
'''

from random import randint as rnd # - Импортирует функцию для генерации случайных целых чисел.
from decimal import Decimal as dec # - Импортирует класс для работы с точными числами с плавающей запятой.
from math import sqrt as sq # - Импортирует функцию для вычисления квадратного корня.
from fractions import Fraction as F # - Импортирует класс для работы с дробями
from sys import argv as ar # - Импортирует список аргументов командной строки