'''
Задание №1

Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные.

'''

a = 12
b = 'Hello!'
c = 3.14
d = True

print(f'{type (a) = }')
print(f'{type (b) = }')
print(f'{type (c) = }')
print(f'{type (d) = }') 